<template>
  <div class='v-main-page'>
    <v-notification
            :messages="messages"
            style="z-index: 200;"
        />
        <div class="logo">
          <img src="https://pbs.twimg.com/profile_images/1317252331063418880/BH47wn01_400x400.jpg" alt="">
          <img class="logo-master" src="https://pngimg.com/uploads/ninja/ninja_PNG18.png" alt="">
        </div>
        <div class="logo-right">
          <img src="https://pbs.twimg.com/profile_images/1317252331063418880/BH47wn01_400x400.jpg" alt="">
          <img class="logo-master" src="https://pngimg.com/uploads/ninja/ninja_PNG18.png" alt="">
        </div>
        <img class='v-main-page__img' src="https://sc01.alicdn.com/kf/HTB15a0rSpXXXXafaFXXq6xXFXXXI/206102860/HTB15a0rSpXXXXafaFXXq6xXFXXXI.jpg" alt="">
    <router-link :to="{name: 'catalog'}"><div class="d3"><h3><span>Перейти до каталогу</span></h3></div></router-link>
      <div class="v-main-page__list">
        <div class="catalog-item" v-for="(item,id) in similarProducts" :key="id">
          <p>{{item.title}}</p>
          <img :src="item.img" alt="">
        </div>
      </div>
    <div class="v-main-page__descr" @click="isFeatures = !isFeatures" :class="{ 'features-visible': !isFeatures}">
      <h3>Інтернет-магазин побутової техніки та електроніки MasterShop</h3>
      <span class="material-icons" v-if="!isFeatures">
        close
      </span>
      <span class="material-icons" v-else>
        keyboard_arrow_down
      </span>
<p>Компанія MasterShop існує на українському ринку вже більше 10 років і за цей час встигла отримати звання одного з найкращих магазинів сучасної техніки. Все починалося з невеликих точок продажів, доки фірма не вирішила підкорити світ інтернет-торгівлі. З тих пір будь-який житель України може замовити оригінальну техніку від світових виробників зі швидкою доставкою в своє місто.
</p>
<h4>Що стало причиною успіху MasterShop серед українців?</h4>
<p>
Доступні ціни , адже інтернет-магазин побутової техніки MasterShop робить клієнтам тільки найвигідніші пропозиції і не завищує вартість своїх товарів
Надання додаткових послуг з гарантійного обслуговування, встановлення та налаштування техніки
Професійний контакт-центр, з яким покупець може зв'язатися будь-яким зручним способом і отримати кваліфіковану консультацію
Можливість покупки товарів в кредит на вигідних умовах одного з провідних банків України
Вичерпна інформація про кожен товар, включаючи реальні фото, матеріали виготовлення, відеоогляди та інструкції по застосуванню
Продаж тільки сертифікованої техніки і електроніки, яка пройшла всі етапи тестування і затверджена фахівцями
Надання двох видів гарантії - від магазину MasterShop та офіційного виробника
Програма розширеного сервісу (ПРС ), яка робить гарантійні умови ще більш прийнятними для покупця
Можливість повернення товару протягом 30 днів після отримання, при дотриманні правил, встановлених законом "Про захист прав споживачів"
MasterShop пропонує величезний перелік товарів, починаючи від техніки для приготування їжі, закінчуючи ігровими консолями
Позитивна репутація, яку магазин отримав від покупців за багато років існування на українському ринку
Повний комплекс послуг інтернет- магазина MasterShop
Співробітники компанії оперативно обробляють заявки клієнтів і намагаються виконати замовлення в найкоротші терміни. Для покупців інтернет-магазин комп'ютерної техніки надає кілька способів зв'язку:
</p><p>
Безкоштовний телефонний номер: 0-800-303-505
Електронна пошта
Онлайн чат на сайті компанії
Групи в соціальних мережах
В будь-який день тижня покупець може звернутися в онлайн магазин техніки MasterShop, для того щоб дізнатися про стан свого замовлення або уточнити будь-яку інформацію.
<br>
На сторінках MasterShop покупки здійснює не тільки Київ, а й вся Україна, завдяки широким можливостям доставки. У штаті компанії працюють виконавчі співробітники, які можуть привезти техніку додому клієнтові, встановити її та налаштувати для подальшого використання. Також товар можна забрати самовивозом протягом 24 годин.
</p>
<h4>
Чому служба доставки MasterShop заслуговує вашої довіри:</h4>
<p>
Бригада доставить і підніме на поверх техніку будь-якої ваги і габаритів, навіть якщо не працює ліфт
за годину до прибуття, фахівці зв'язуються з клієнтом по телефону
MasterShop несе повну відповідальність за збереження товару в процесі перевезення
При необхідності вантажники надінуть бахіли, перш ніж увійти в будинок клієнта
Перед відправкою фахівці ретельно перевіряють комплектацію замовлення, а також справність техніки
У разі виявлення будь-яких неполадок у техніці, служба доставки безкоштовно привезе новий справний товар з магазину
При замовленні декількох товарів відразу MasterShop доставляє всю техніку в один день
Можливості, які надає онлайн магазин техніки MasterShop
Найширша мережа магазинів MasterShop розкинулася по всій Україні, але все ж велика частина споживачів віддає перевагу здійсненню покупки через офіційний сайт компанії. Чому? В інтернет-магазині перед вами розкривається повний перелік товарів з усіма доступними послугами додаткового обслуговування. Клієнт може замовити будь-який побутовий прилад або електронний гаджет зі швидкою доставкою в своє місто, витративши на це мінімум зусиль і часу.
</p><h4>
Також, купуючи товар в MasterShop ви відчуєте такі переваги, як:</h4>
<p>
Унікальні системи знижок і регулярні розпродажі. На свою електронну пошту покупці отримують акціїні промокоди, які можна застосувати просто на сторінці оформлення замовлення.
Постійним клієнтам MasterShop видає спеціальну карту від Клубу Суперпокупателей, на яку нараховуються бонуси. Отримані бали можна використовувати при наступних покупках і тим самим економити чималі суми
Онлайн-магазин надає можливість оплати частинами або покупки техніки в кредит
На сайті викладені реальні відгуки покупців. Ви зможете поділитися посиланням товару в соціальній мережі або отримати слушні поради по експлуатації техніки від інших споживачів
Простий спосіб оформлення замовлення, який не вимагає від вас ніякої додаткової контактної інформації, крім - П.І.Б., адреси доставки та номера телефону
MasterShop - це лідируючий інтернет-магазин електроніки, який робить все заради зручності своїх покупців. Він заслужив визнання тисяч українців, завдяки високій якості обслуговування і демократичній ціновій політиці. Сучасні технології повинні прийти в будинок кожної сім'ї, тому що це запорука якісного і комфортного життя!
<br>
Після грандіозних знижок на Black Friday, вас чекає КІБЕРПОНЕДІЛОК, який продовжує сезон передноворічних розпродажів в MasterShop.</p>
    </div>
  </div>
</template>

<script>
  import {mapActions, mapGetters} from 'vuex'
  import vNotification from '../notifications/v-notification'

  export default {
    name: "v-main-page",
    props: {},
    data() {
      return {
        isFeatures: true,
      }},
    components: {
      vNotification,
    },
    computed: {
      ...mapGetters([
        'PRODUCTS',
      ]),
        similarProducts: function() {
            var filtered = this.PRODUCTS
            return filtered
        },
    },
    mounted() {
      if (!this.PRODUCTS.length) {
        this.GET_PRODUCTS_FROM_API()
      }
    },
    methods: {
      ...mapActions([
        'GET_PRODUCTS_FROM_API',
      ]),
    }
      }
  
</script>

<style scoped lang="scss">
  .v-main-page__descr {
    text-align: justify;
    padding: 20px 40px;
    height: 140px;
    overflow: hidden;

    h3 {
      display: inline-block;
      margin-right: 40px;
    }
    }

  .features-visible {
    height: 100%;
  }

  .v-main-page__list {
    display: flex;
    overflow-x: scroll;
    overflow-y: hidden;
    margin: 0 20px;
    padding: 20px 0;
    height: 350px;
    border-top: 4px solid lightseagreen;
    border-bottom: 4px solid lightseagreen;

    .catalog-item {
      min-width: 300px;
      overflow-y: hidden;
      font-weight: bolder;
      margin: 0 10px;

      p {
        height: 70px;
      }

      img {
        width: 90%;
        margin: 0 auto;
      }
    }
  }
     .d3 {
      position: relative;
      text-align: left;
    }
    .d3 h3:before {
      content: "";
      position: absolute;
      top: 50%;
      height: 6px;
      width: 40px;
      left: 60px;
      background: sandybrown;
    }
    .d3 h3:after{
      content: "";
      position: absolute;
      top: 50%;
      height: 6px;
      width: 290px;
      background: sandybrown;
    }
    .d3 span {
      background: white;
      padding: 0 15px;
      margin-left: 100px;
    }

    .v-main-page__img {
      width: 60vw;
      margin-top: -50px;
      margin-bottom: 40px;
    }

    .logo, .logo-right {
      position: absolute;
      width: 20vw;
      top: 10vh;

      img {
        width: 100%;
      }

      .logo-master {
        margin-top: -40px;
      }
    }

    .logo-right {
      right: 0;

      .logo-master {
        transform: rotateY(180deg);
      }
    }
</style>
